Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: If the container is scrollable and the focused child is out of the view, gridnav will automatically scroll the child into view.
it_it: Se il contenitore è scorrevole e il figlio con focus è fuori dalla vista, gridnav scorrerà automaticamente il figlio nella vista.

source: If the data is dynamically allocated, the user must free it to prevent memory leaks.
it_it: Se i dati vengono allocati dinamicamente, l'utente deve liberarli per evitare "leak" [perdite] di memoria.

source: If the default theme is enabled by :c:macro:`LV_USE_THEME_DEFAULT` LVGL automatically initializes and sets it when a display is created.
it_it: Se il tema di default è abilitato da :c:macro:`LV_USE_THEME_DEFAULT` LVGL lo inizializza e lo imposta automaticamente quando viene creato un display.

source: If the direction of the Drop-Down List is :cpp:enumerator:`LV_DIR_LEFT` the symbol will be shown on the left, otherwise on the right.
it_it: Se la direzione della Drop-Down List è :cpp:enumerator:`LV_DIR_LEFT` il simbolo verrà visualizzato a sinistra, altrimenti a destra.

source: If the display is not partial, then there is no need to enable this option.
it_it: Se la visualizzazione non è parziale, non è necessario abilitare questa opzione.

source: If the driver can provide precise timestamps for buffered events, it can overwrite ``data->timestamp``.
it_it: Se il driver è in grado di fornire timestamp precisi per gli eventi memorizzati nel buffer, può sovrascrivere ``data->timestamp``.

source: If the focused state had a higher precedence it would overwrite the pressed color.
it_it: Se lo stato con focus avesse una precedenza maggiore, sovrascriverebbe il colore di "pressed".

source: If the folder(s) referenced in ``fn_ref`` do not exist, they will be created automatically.
it_it: Se le cartelle a cui si fa riferimento in ``fn_ref`` non esistono, verranno create automaticamente.

source: If the font already has a stride of 1, it will be uploaded directly without conversion, which can improve asset upload time.
it_it: Se il font ha già uno stride pari a 1, verrà caricato direttamente senza conversione, il che può ridurre i tempi di caricamento della risorsa.

source: If the font in use does not have a glyph needed in a text-rendering task, you can specify a ``fallback`` font to be used in :cpp:type:`lv_font_t`.
it_it: Se il font in uso non ha un glifo necessario per un'attività di rendering del testo, è possibile specificare un font ``fallback`` da utilizzare in :cpp:type:`lv_font_t`.

source: If the font's stride is not 1, it will be converted to stride 1 before being uploaded to EVE.
it_it: Se lo "stride" del font non è 1, verrà convertito in "stride 1" prima di essere caricato su EVE.

source: If the font, line space, border width, etc. of the Roller changes, this function needs to be called again.
it_it: Se il font, l'interlinea, lo spessore del bordo, ecc. del Roller cambiano, questa funzione deve essere richiamata nuovamente.

source: If the format is known, but you don't want to decode the entire image (e.g. no memory for it), set ``dsc->decoded = NULL`` and use ``decoder_get_area()`` to get the image area pixels.
it_it: Se il formato è noto, ma non si desidera decodificare l'intera immagine (ad esempio, non si dispone di memoria), si imposta ``dsc->decoded = NULL`` e si usa ``decoder_get_area()`` per ottenere i pixel dell'area dell'immagine.

source: If the fractions array is ``NULL`` the colors will be distributed evenly.
it_it: Se l'array di frazioni è ``NULL``, i colori saranno distribuiti uniformemente.

source: If the framebuffer is not reserved in the linker script or the framebuffer is not set during board initialization, you may absolutely set it at runtime before creating the LVGL display.
it_it: Se il framebuffer non è riservato nello script del linker o non è impostato durante l'inizializzazione della board, è assolutamente possibile impostarlo in fase di esecuzione prima di creare il display LVGL.

source: If the function execution time is lower than the precision of the timestamps, this situation can occur.
it_it: Se il tempo di esecuzione della funzione è inferiore alla precisione dei timestamp, questa situazione può verificarsi.

source: If the height is :c:macro:`LV_SIZE_CONTENT` the Label's height will be expanded, otherwise the text will be clipped.
it_it: Se l'altezza è :c:macro:`LV_SIZE_CONTENT`, l'altezza dell'etichetta verrà espansa, altrimenti il testo verrà tagliato.

source: If the height is set programmatically, the content will become scrollable.
it_it: Se l'altezza viene impostata a livello di codice, il contenuto diventerà scorrevole.

source: If the image is already cached and you then change the underlying PNG file, you need to notify LVGL to cache the image again.
it_it: Se l'immagine è già memorizzata nella cache e si modifica il file PNG sottostante, è necessario notificare a LVGL di memorizzare nuovamente l'immagine nella cache.

source: If the image was converted to a variable with the :ref:`online <images_online_converter>` or :ref:`offline converter <images_offline_converter>`, you should use :cpp:expr:`LV_IMAGE_DECLARE(my_img_dsc)` to declare the image in the file where you want to use it.
it_it: Se l'immagine è stata convertita in una variabile col convertitore :ref:`online <images_online_converter>` o quello :ref:`offline <images_offline_converter>`, si dovrebbe usare :cpp:expr:`LV_IMAGE_DECLARE(my_img_dsc)` per dichiarare l'immagine nel file in cui vuoi usarla.

source: If the images are converted to arrays and compiled into the firmware, they need to be registered explicitly using:
it_it: Se le immagini vengono convertite in array e compilate nel firmware, devono essere registrate esplicitamente utilizzando:

source: If the images are used as files (e.g., PNG images loaded from a file system), they can be simply added to ``globals.xml``:
it_it: Se le immagini vengono utilizzate come file (ad esempio, immagini PNG caricate da un file system), possono essere semplicemente aggiunte a ``globals.xml``:

source: If the list needs to be numbered, numbers can also be used.
it_it: Se l'elenco deve essere numerato, è possibile utilizzare anche i numeri.

source: If the list of document source files (including the .h files in the ./src/ directory) has changed (names or paths):
it_it: Se l'elenco dei file sorgenti del documento (inclusi i file .h nella directory ./src/) è cambiato (nomi o path):

source: If the list would be vertically out of the screen, it will be aligned to the edge.
it_it: Se l'elenco si troverà verticalmente fuori dallo schermo, verrà allineato al bordo.

source: If the log parsing is successful, you will see a screen similar to the following:
it_it: Se l'analisi del log ha esito positivo, verrà visualizzata una schermata simile alla seguente:

source: If the logs are incomplete, it may be due to the following reasons:
it_it: Se i log fossero incompleti, le cause potrebbero essere le seguenti:

source: If the minimum value is greater than the maximum value, like 100..0, the drawing direction is reversed.
it_it: Se il valore minimo è maggiore del valore massimo, ad esempio 100..0, la direzione di disegno viene invertita.

source: If the minimum value is set to be greater than the maximum value (e.g. [100..0]), the drawing direction is reversed.
it_it: Se il valore minimo è impostato su un valore maggiore del valore massimo (ad esempio [100..0]), la direzione di disegno viene invertita.

source: If the note contains more than one paragraph, additional paragraphs can be added by using additional ``@note`` commands.
it_it: Se la nota contiene più di un paragrafo, è possibile aggiungerne altri utilizzando altri comandi ``@note``.

source: If the object (variable) being deleted is a type of Widget, the housekeeping code involved in deleting it also deletes any running animations that are connected with it.
it_it: Se l'oggetto (variabile) eliminato è un tipo di Widget, il codice di gestione coinvolto nella sua eliminazione elimina anche tutte le animazioni in esecuzione ad esso collegate.

source: If the opacity array is ``NULL`` 255 will be used for each stop.
it_it: Se l'array di opacità è ``NULL``, verranno utilizzati 255 colori per ogni stop.

source: If the opacity or width is 0, no Draw Task will be created.
it_it: Se l'opacità o la larghezza sono pari a 0, non verrà creata alcun Task di Disegno.

source: If the parent also has :cpp:enumerator:`LV_OBJ_FLAG_EVENT_BUBBLE` enabled the event will be sent to its parent, and so on.
it_it: Se anche il Widget padre ha :cpp:enumerator:`LV_OBJ_FLAG_EVENT_BUBBLE` abilitato, l'evento verrà inviato al Widget padre e così via.

source: If the parent can be scrolled in that direction than it will be scrolled instead.
it_it: Se il genitore può essere scorrevole in quella direzione, verrà invece "scrollato".

source: If the part is :cpp:enumerator:`LV_PART_INDICATOR`, it is a major tick.
it_it: Se la parte è :cpp:enumerator:`LV_PART_INDICATOR`, si tratta di una tacca principale.

source: If the part is :cpp:enumerator:`LV_PART_ITEMS` it is a minor tick.
it_it: Se la parte è :cpp:enumerator:`LV_PART_ITEMS`, si tratta di una tacca secondaria.

source: If the performance monitor is enabled, the value of :c:macro:`LV_DEF_REFR_PERIOD` needs to be set to match the refresh period of the display to ensure that the statistical results are correct.
it_it: Se il monitoraggio delle prestazioni è abilitato, il valore di :c:macro:`LV_DEF_REFR_PERIOD` deve essere impostato in modo che corrisponda al periodo di aggiornamento del display per garantire che i risultati statistici siano corretti.

source: If the point's position changes (via a new value or via scrolling), the cursor moves with the point.
it_it: Se la posizione del punto cambia (tramite un nuovo valore o tramite scorrimento), il cursore si sposta con il punto.

source: If the position of a parent changes, its children will move along with it.
it_it: Se la posizione di un elemento padre cambia, anche gli elementi figlio si sposteranno di conseguenza.

source: If the property is not set even for the default state the default value will be used.
it_it: Se la proprietà non è impostata nemmeno per lo stato di default, verrà utilizzato il valore di default.

source: If the property you need to set or get using this API is not implemented yet, you can add your own Widget property ID following same rules and using one of two helper macros in the ``enum`` in the Widget's primary ``.h`` file.
it_it: Se la proprietà da impostare o ottenere tramite questa API non è ancora implementata, è possibile aggiungere un ID di proprietà Widget personalizzato seguendo le stesse regole e utilizzando una delle due macro helper presenti in ``enum`` nel file ``.h`` principale del Widget.

source: If the reference image is not found, it will be created automatically from the rendered screen (unless ``LV_TEST_SCREENSHOT_CREATE_REFERENCE_IMAGE`` is ``0``).
it_it: Se l'immagine di riferimento non viene trovata, verrà creata automaticamente dalla schermata renderizzata (a meno che ``LV_TEST_SCREENSHOT_CREATE_REFERENCE_IMAGE`` non sia ``0``).

source: If the size is set explicitly, parts on the Line may not be visible.
it_it: Se le dimensioni venissero impostate esplicitamente, alcune parti della Linea potrebbero non essere visibili.

source: If the snapshot needs to be updated repeatedly, or if the caller provides the draw buffer, use :cpp:expr:`lv_snapshot_take_to_draw_buf(widget, color_format, draw_buf)`.
it_it: Se lo snapshot deve essere aggiornato ripetutamente o se il chiamante fornisce il buffer di disegno, si usa :cpp:expr:`lv_snapshot_take_to_draw_buf(widget, color_format, draw_buf)`.

source: If the source tarball extracts the code to a directory named anything other than ${BPN}-${PV}, or if the source code is fetched from an SCM such as Git or Subversion, then you must set S in the recipe so that the OpenEmbedded build system knows where to find the unpacked source.
it_it: Se il tarball sorgente estrae il codice in una directory con un nome diverso da ${BPN}-${PV}, o se il codice sorgente viene recuperato da un SCM come Git o Subversion, è necessario impostare S nella ricetta in modo che il sistema di build di OpenEmbedded sappia dove trovare il codice sorgente decompresso.

source: If the subject also sets a min/max value the narrower range will be used.
it_it: Se anche il subject imposta un valore min/max, verrà utilizzato l'intervallo più ristretto.

source: If the tag is not found at all, the tag itself will be used as a fallback as well.
it_it: Anche se il tag non viene trovato, verrà utilizzato come alternativa.

source: If the text in the Text Area is very long (e.g. > 20k characters), scrolling and drawing might be slow.
it_it: Se il testo nella Text Area fosse molto lungo (ad esempio > 20.000 caratteri), lo scorrimento e il disegno potrebbero risultare lenti.

source: If the text is ``NULL`` the selected option is displayed on the button.
it_it: Se il testo è ``NULL``, l'opzione selezionata viene visualizzata sul pulsante.

source: If the trace logs are not automatically printed when the buffer is not full, you can try the following methods to force the log output:
it_it: Se i log di trace non vengono stampati automaticamente quando il buffer non è pieno, è possibile provare i seguenti metodi per forzare l'output del log:

source: If the type is ``type="lv_obj"``, it allows the element to have child widgets or components.
it_it: Se il tipo è ``type="lv_obj"``, l'elemento può avere widget o componenti figli.

source: If the up-coming pixels are not repeated, it stores the non-repeat count value and original color values.
it_it: Se i pixel successivi non sono ripetuti, memorizza il valore del conteggio non ripetuto e i valori del colore originale.

source: If the user is configuring the display manually, it is possible to enable the DMA2D in runtime by setting the DMA2D flag to true:
it_it: Se l'utente sta configurando il display manualmente, è possibile abilitare DMA2D in fase di esecuzione impostando il flag DMA2D a true:

source: If the user needs to access or modify values dynamically, it is recommended to use :ref:`Data bindings via Subject <xml_subjects>`.
it_it: Se l'utente ha bisogno di accedere o modificare i valori in modo dinamico, si consiglia di un :ref:`Data binding tramite Subject <xml_subjects>`.

source: If the user sets only 200 px height for the table LVGL will see that the self size is larger and make the table scrollable.
it_it: Se l'utente imposta solo un'altezza di 200 px per la tabella, LVGL vedrà che la dimensione automatica è maggiore e renderà la tabella scorrevole.

source: If the value is changed by :cpp:expr:`lv_spinbox_set_value(spinbox)`, by *Keys*, by :cpp:expr:`lv_spinbox_increment(spinbox)` or :cpp:expr:`lv_spinbox_decrement(spinbox)` this range will be respected.
it_it: Se il valore viene modificato da :cpp:expr:`lv_spinbox_set_value(spinbox)`, dai *Tasti*, da :cpp:expr:`lv_spinbox_increment(spinbox)` o da :cpp:expr:`lv_spinbox_decrement(spinbox)` questo intervallo verrà rispettato.

source: If the width or height is set to a smaller number than its "intrinsic" size then the Table becomes scrollable.
it_it: Se la larghezza o l'altezza sono impostate su un numero inferiore alla loro dimensione "intrinseca", la tabella diventa scorrevole.

source: If there are 2 buttons on the screen, those 2 buttons can be rendered in parallel, but 2 cores will still remain idle.
it_it: Se ci sono 2 pulsanti sullo schermo, questi 2 pulsanti possono essere renderizzati in parallelo, ma 2 core rimarranno comunque inattivi.

source: If there are 4 tiles, the ideal tile size is approximately 93k pixels.
it_it: Se ci sono 4 tile, la dimensione ideale del tile è di circa 93k pixel.

source: If there are any commands that should be sent to initialize the display, send them before entering the timer loop.
it_it: Se sono presenti comandi da inviare per inizializzare il display, inviarli prima di entrare nel ciclo del timer.

source: If there are any compilation steps, then these steps are define in do_compile() function of bitbake.
it_it: Se sono presenti passaggi di compilazione, questi vengono definiti nella funzione do_compile() di bitbake.

source: If there are many gradients used in the interface, you can try increasing the number of gradient cache entries.
it_it: Se nell'interfaccia vengono utilizzati molti gradienti, si può provare ad aumentare il numero di voci nella cache dei gradienti.

source: If there are still fonts being referenced, the font manager will fail to be destroyed and the function will return false.
it_it: Se sono ancora presenti font referenziati, il gestore font non verrà eliminato e la funzione restituirà false.

source: If there are, let's say, 10 points to a pixel, LVGL searches the smallest and the largest value and draws a vertical lines between them to ensure no peaks are missed.
it_it: Se, ad esempio, ci sono 10 punti per pixel, LVGL cerca il valore più piccolo e quello più grande e disegna delle linee verticali tra di essi per garantire che non vengano trascurati picchi.

source: If there is RAM available, SVG performance can be increased by enabling the image cache, ``LV_CACHE_DEF_SIZE``.
it_it: Se è disponibile RAM, le prestazioni di SVG possono essere aumentate abilitando la cache delle immagini, ``LV_CACHE_DEF_SIZE``.

source: If there is a visible border on a side and no padding on that side, the division line would be drawn on top of the border and in this case it is not drawn so as not to hide the chart border.
it_it: Se è presente un bordo visibile su un lato e non è presente alcun "padding" [riempimento], la linea di divisione verrà disegnata sopra il bordo e in questo caso non verrà disegnata per non nascondere il bordo del grafico.

source: If there is almost enough memory for double-buffered direct mode, but not quite, then use partial render mode.
it_it: Se la memoria disponibile è quasi sufficiente per la modalità diretta a doppio buffer, ma non del tutto, utilizzare la modalità di rendering parziale.

source: If there is an active theme LVGL applies it to every newly-created widget.
it_it: Se è presente un tema attivo, LVGL lo applica a ogni widget appena creato.

source: If there is an issue with the path configured or you need to change it, simply delete this file and click the LVGL Editor button again to reconfigure it.
it_it: In caso di problemi col path configurato o se è necessario modificarlo, è sufficiente eliminare questo file e cliccare nuovamente sul pulsante LVGL Editor per riconfigurarlo.

source: If there is no external event source, you may choose to exit the loop or simply delay for a long time.
it_it: Se non c'è una sorgente di eventi esterni, si può scegliere di uscire dal ciclo o semplicemente ritardare a lungo.

source: If there is no memory for a new chunk, LVGL will try allocating the layer after another chunk is rendered and freed.
it_it: Se non c'è memoria per un nuovo blocco, LVGL tenterà di allocare il layer dopo che un altro blocco sarà stato renderizzato e liberato.

source: If there is no more room for scrolling the next/previous Widget will receive focus normally.
it_it: Se non c'è più spazio per lo scorrimento, il Widget successivo/precedente riceverà il focus normalmente.

source: If there is some empty space, items (Widgets) in Grid tracks can be aligned in several ways:
it_it: Se c'è dello spazio vuoto, gli elementi (Widget) nelle track della Grid possono essere allineati in diversi modi:

source: If there were any difficulties faced while following this guide, refer to these Alif sources for more detailed steps.
it_it: In caso di difficoltà durante la lettura di questa guida, fare riferimento a queste fonti Alif per passaggi più dettagliati.

source: If this define is set :c:macro:`LV_CONF_SKIP` is assumed to be ``0``.
it_it: Se questa definizione è settata, :c:macro:`LV_CONF_SKIP` si presume sia ``0``.

source: If this doesn't appear or doesn't work, you can review your project include paths under the **Project** -> **Properties** menu, and then navigating to **C/C++ Build** -> **Settings** -> **Include paths**, and ensuring that the LVGL directory is listed.
it_it: Se questa opzione non viene visualizzata o non funziona, si possono controllare i percorsi di inclusione del progetto nel menu **Project** -> **Properties**, quindi andare in **C/C++ Build** -> **Settings** -> **Include paths** e assicurarsi che la directory LVGL sia elencata.

source: If this format/type is not supported by the decoder, return :cpp:enumerator:`LV_RESULT_INVALID`.
it_it: Se questo formato/tipo non è supportato dal decoder, restituire :cpp:enumerator:`LV_RESULT_INVALID`.

source: If this is not set then a config file will be generated that has the most common LVGL options turned on.
it_it: Se non è impostato, verrà generato un file di configurazione con le opzioni LVGL più comuni attivate.

source: If this is not the case (opacity < 100%) the display's ``bottom_layer`` will be visible.
it_it: In caso contrario (opacità < 100%), il ``bottom_layer`` del display sarà visibile.

source: If this is the case, you can use ``lv_libinput_find_dev`` to find the first device that has a specific capability.
it_it: In questo caso, è possibile utilizzare ``lv_libinput_find_dev`` per trovare il primo dispositivo con una funzionalità specifica.

source: If this is the first time, you will be prompted to choose which serial port to use to flash the board.
it_it: Se è la prima volta, verrà chiesto di scegliere quale porta seriale utilizzare per flashare la scheda.

source: If transformation properties were also used the layer cannot be rendered in chunks
it_it: Se sono state utilizzate anche le proprietà di trasformazione, il layer non può essere renderizzato in blocchi.

source: If translations are only available at runtime (e.g., from files, serial ports, or online sources), they can be added dynamically.
it_it: Se le traduzioni sono disponibili solo in fase di esecuzione (ad esempio, da file, porte seriali o fonti online), possono essere aggiunte dinamicamente.

source: If two buffers are used LVGL can draw into one buffer while the content of the other buffer is sent to the display in the background.
it_it: Se vengono utilizzati due buffer, LVGL può disegnare in un buffer mentre il contenuto dell'altro buffer viene inviato al display in background.

source: If two buffers are used, the rendered areas are automatically copied to the other buffer after flushing.
it_it: Se vengono utilizzati due buffer, le aree renderizzate vengono automaticamente copiate nell'altro buffer dopo il flush.

source: If two display-sized draw buffers are provided, LVGL's display handling works like "traditional" double buffering.
it_it: Se vengono forniti due buffer di disegno delle dimensioni del display, la gestione del display da parte di LVGL funziona come un doppio buffer "tradizionale".

source: If used, local styles are allocated automatically, and freed when the Widget is deleted.
it_it: Se utilizzati, gli stili locali vengono allocati automaticamente e liberati quando il Widget viene eliminato.

source: If using :c:macro:`LV_USE_NEMA_VG`, set :c:macro:`LV_NEMA_GFX_MAX_RESX` and :c:macro:`LV_NEMA_GFX_MAX_RESY` to the size of the display you will be using so that enough static memory will be reserved for VG.
it_it: Se si utilizza :c:macro:`LV_USE_NEMA_VG`, impostare :c:macro:`LV_NEMA_GFX_MAX_RESX` e :c:macro:`LV_NEMA_GFX_MAX_RESY` in base alle dimensioni del display che si utilizzerà, in modo che venga riservata sufficiente memoria statica per VG.
